load-test-results/2025-06-08_test_1/20250608_161448_baseline_fast_heavy.txt
Running 1m test @ http://localhost:8080/fast
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.72ms   15.43ms  80.30ms   81.65%
    Req/Sec     3.67k   296.89     5.57k    83.21%
  1755199 requests in 1.00m, 359.88MB read
Requests/sec:  29246.82
Transfer/sec:      6.00MB