load-test-results/2025-06-08_test_1/20250608_161448_gateway_fast_light.txt
Running 30s test @ http://localhost:3000/fast
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec     6.26      7.55    20.00     82.61%
  38 requests in 30.05s, 6.79KB read
  Socket errors: connect 0, read 0, write 0, timeout 38
Requests/sec:      1.26
Transfer/sec:     231.43B