load-test-results/2025-06-08_test_1/20250608_161448_gateway_fast_medium.txt
Running 1m test @ http://localhost:3000/fast
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   127.33ms  259.20ms   2.00s    88.32%
    Req/Sec   241.05    192.27   500.00     45.86%
  29011 requests in 1.00m, 3.46MB read
  Socket errors: connect 0, read 0, write 0, timeout 134
  Non-2xx or 3xx responses: 28961
Requests/sec:    482.97
Transfer/sec:     59.00KB