load-test-results/2025-06-08_test_1/20250608_161448_gateway_mixed_load.txt
Running 1m test @ http://localhost:3000
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09s   204.30ms   1.62s    68.00%
    Req/Sec     6.46      7.51    40.00     89.09%
  275 requests in 1.00m, 37.45KB read
  Socket errors: connect 0, read 0, write 0, timeout 250
  Non-2xx or 3xx responses: 191
Requests/sec:      4.58
Transfer/sec:     638.22B